print("1.รับค่า * เข้ามาหนึ่งครั้ง จากนั้นรับตัวเลขจํานวนเต็ม แล้วให้แสดงผลลัพธ์ดังนี้")
      

c = input()
x = int(input())
n = c*x
print(n)

print("2.เขียนโปรแกรมรับจำนวนคะแนนสอบกลางภาค และปลายภาค ซึ่งแต่ละครั้งมีคะแนนและ ค่าเฉลี่ยของคะแนนนสอบทั้งสองครั้ง บรรทัดแรก รับจำนวนจริง midterm แทนคะแนนสอบกลางภาค โดย  0<= midterm <=60 บรรทัดที่ สอง รับจำนวนจริง Final แทนคะแนนสอบปลายภาค โดย  0<= final <=60 OUTPUT บรรทัดแรกแสดงข้อความ “Total:” ตามด้วยผลรวมของคะแนนนสอบทั้งสองครั้ง บรรทัดที่สองแสดงข้อความ “Average:” ตามด้วยค่าเฉลี่ยของคะแนนนสอบทั้งสองครั้ง **กำหนดค่า Input = 50.5 และ 31.5 ")
midterm = float(input())
final = float(input())
total = midterm + final
Average = total / 60
print(total)
print(Average)

print("3.กำหนดให้สระว่ายน้ำ เป็นรูปสี่เหลี่ยมผืนผ้า โดยเราต้องการเติมน้ำลงไปในสระให้เต็ม จงเขียน โปรแกรมเพื่อรับความกว้าง ความยาว และความลึกของสระในหน่วยเมตร เพื่อคำนวณว่าต้องใช้ เวลากี่นาทีในการเติมน้ำลงในสระให้เต็ม เมื่อกำหนดให้")
w = float(input())
l = float(input())
d = float(input())

v = w*l*d
ts = v*15
tm = ts/60
print(tm)
